RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
/**
 *******************************************************************************
 * @file  hc32f4a0_sdioc.c
 * @brief This file provides firmware functions to manage the Secure Digital
 *        Input and Output Controller(SDIOC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Yangjp          First version
   2020-08-11       Yangjp          Fix a known potential risk in SDIOC_VerifyClockDiv function
   2020-09-04       Yangjp          Optimize timeout handling in functions
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_sdioc.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_SDIOC SDIOC
 * @brief SDIOC Driver Library
 * @{
 */

#if (DDL_SDIOC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup SDIOC_Local_Macros SDIOC Local Macros
 * @{
 */

/* Masks for R6 Response */
#define SDMMC_R6_GENERAL_UNKNOWN_ERROR          (0x00002000UL)
#define SDMMC_R6_ILLEGAL_CMD                    (0x00004000UL)
#define SDMMC_R6_COM_CRC_FAILED                 (0x00008000UL)

/* SDMMC command parameters */
#define SDMMC_CMD8_CHECK_PATTERN                (0x000001AAUL)
/* 3.2V-3.3V */
#define SDMMC_ACMD41_VOLTAGE_WINDOW             (0x80100000UL)

/* Command send and response timeout(ms) */
#define SDMMC_CMD_TIMEOUT                       (5000UL)
/* Max erase Timeout 60s */
#define SDMMC_MAX_ERASE_TIMEOUT                 (60000UL)

/* SDIOC software reset timeout(ms) */
#define SDIOC_SW_RESET_TIMEOUT                  (50UL)

/* SDIOC NORINTSGEN register Mask */
#define SDIOC_NORINTSGEN_CLEAR_MASK             (0x01F7U)
/* SDIOC ERRINTSGEN register Mask */
#define SDIOC_ERRINTSGEN_CLEAR_MASK             (0x017FU)

/*!< Get the specified register address of the specified SDIOC unit */
#define SDIOC_ARG(__UNIT__)                     ((uint32_t)(&((__UNIT__)->ARG0)))
#define SDIOC_BUF(__UNIT__)                     ((uint32_t)(&((__UNIT__)->BUF0)))
#define SDIOC_RESPx(__UNIT__, RESP_REG)         ((uint32_t)(&((__UNIT__)->RESP0)) + (uint32_t)(RESP_REG))

/**
 * @defgroup SDIOC_Check_Parameters_Validity SDIOC Check Parameters Validity
 * @{
 */
#define IS_SDIOC_UNIT(x)                                                       \
(   ((x) == M4_SDIOC1)                          ||                             \
    ((x) == M4_SDIOC2))

#define IS_SDIOC_MODE(x)                                                       \
(   ((x) == SDIOC_MODE_SD)                      ||                             \
    ((x) == SDIOC_MODE_MMC))

#define IS_SDIOC_CARD_DETECT_SELECT(x)                                         \
(   ((x) == SDIOC_CARD_DETECT_CD_PIN_LEVEL)     ||                             \
    ((x) == SDIOC_CARD_DETECT_TEST_SIGNAL))

#define IS_SDIOC_CARD_DETECT_TEST_LEVEL(x)                                     \
(   ((x) == SDIOC_CARD_DETECT_TEST_LEVEL_LOW)   ||                             \
    ((x) == SDIOC_CARD_DETECT_TEST_LEVEL_HIGH))

#define IS_SDIOC_SPEED_MODE(x)                                                 \
(   ((x) == SDIOC_SPEED_MODE_NORMAL)            ||                             \
    ((x) == SDIOC_SPEED_MODE_HIGH))

#define IS_SDIOC_BUS_WIDTH(x)                                                  \
(   ((x) == SDIOC_BUS_WIDTH_1BIT)               ||                             \
    ((x) == SDIOC_BUS_WIDTH_4BIT)               ||                             \
    ((x) == SDIOC_BUS_WIDTH_8BIT))

#define IS_SDIOC_CLOCK_DIV(x)                                                  \
(   ((x) == SDIOC_CLOCK_DIV_1)                  ||                             \
    ((x) == SDIOC_CLOCK_DIV_2)                  ||                             \
    ((x) == SDIOC_CLOCK_DIV_4)                  ||                             \
    ((x) == SDIOC_CLOCK_DIV_8)                  ||                             \
    ((x) == SDIOC_CLOCK_DIV_16)                 ||                             \
    ((x) == SDIOC_CLOCK_DIV_32)                 ||                             \
    ((x) == SDIOC_CLOCK_DIV_64)                 ||                             \
    ((x) == SDIOC_CLOCK_DIV_128)                ||                             \
    ((x) == SDIOC_CLOCK_DIV_256))

#define IS_SDIOC_CMD_TYPE(x)                                                   \
(   ((x) == SDIOC_CMD_TYPE_NORMAL)              ||                             \
    ((x) == SDIOC_CMD_TYPE_SUSPEND)             ||                             \
    ((x) == SDIOC_CMD_TYPE_RESUME)              ||                             \
    ((x) == SDIOC_CMD_TYPE_ABORT))

#define IS_SDIOC_DATA_LINE(x)                                                  \
(   ((x) == SDIOC_DATA_LINE_DISABLE)            ||                             \
    ((x) == SDIOC_DATA_LINE_ENABLE))

#define IS_SDIOC_TRANSFER_DIR(x)                                               \
(   ((x) == SDIOC_TRANSFER_DIR_TO_CARD)         ||                             \
    ((x) == SDIOC_TRANSFER_DIR_TO_HOST))

#define IS_SDIOC_AUTO_SEND_CMD12(x)                                            \
(   ((x) == SDIOC_AUTO_SEND_CMD12_DISABLE)      ||                             \
    ((x) == SDIOC_AUTO_SEND_CMD12_ENABLE))

#define IS_SDIOC_TRANSFER_MODE(x)                                              \
(   ((x) == SDIOC_TRANSFER_MODE_SINGLE)         ||                             \
    ((x) == SDIOC_TRANSFER_MODE_INFINITE)       ||                             \
    ((x) == SDIOC_TRANSFER_MODE_MULTIPLE)       ||                             \
    ((x) == SDIOC_TRANSFER_MODE_STOP_MULTIPLE))

#define IS_SDIOC_DATA_TIMEOUT_TIME(x)                                          \
(   ((x) == SDIOC_DATA_TIMEOUT_CLK_2_13)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_14)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_15)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_16)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_17)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_18)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_19)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_20)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_21)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_22)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_23)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_24)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_25)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_26)        ||                             \
    ((x) == SDIOC_DATA_TIMEOUT_CLK_2_27))

#define IS_SDIOC_RESPONSE_REG(x)                                               \
(   ((x) == SDIOC_RESPONSE_REG_BIT0_31)         ||                             \
    ((x) == SDIOC_RESPONSE_REG_BIT32_63)        ||                             \
    ((x) == SDIOC_RESPONSE_REG_BIT64_95)        ||                             \
    ((x) == SDIOC_RESPONSE_REG_BIT96_127))

