RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
#define IS_SDIOC_SW_RESET_TYPE(x)                                              \
(   ((x) == SDIOC_SW_RESET_DATA_LINE)           ||                             \
    ((x) == SDIOC_SW_RESET_CMD_LINE)            ||                             \
    ((x) == SDIOC_SW_RESET_ALL))

#define IS_SDIOC_OUTPUT_CLK_FREQ(x)                                            \
(   ((x) == SDIOC_OUTPUT_CLK_FREQ_400K)         ||                             \
    ((x) == SDIOC_OUTPUT_CLK_FREQ_25M)          ||                             \
    ((x) == SDIOC_OUTPUT_CLK_FREQ_26M)          ||                             \
    ((x) == SDIOC_OUTPUT_CLK_FREQ_50M)          ||                             \
    ((x) == SDIOC_OUTPUT_CLK_FREQ_52M))

#define IS_SDIOC_GET_HOST_FLAG(x)                                              \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(SDIOC_HOST_FLAG_CMDL       |                  \
                                 SDIOC_HOST_FLAG_DATL       |                  \
                                 SDIOC_HOST_FLAG_DATL_D0    |                  \
                                 SDIOC_HOST_FLAG_DATL_D1    |                  \
                                 SDIOC_HOST_FLAG_DATL_D2    |                  \
                                 SDIOC_HOST_FLAG_DATL_D3    |                  \
                                 SDIOC_HOST_FLAG_WPL        |                  \
                                 SDIOC_HOST_FLAG_CDL        |                  \
                                 SDIOC_HOST_FLAG_CSS        |                  \
                                 SDIOC_HOST_FLAG_CIN        |                  \
                                 SDIOC_HOST_FLAG_BRE        |                  \
                                 SDIOC_HOST_FLAG_BWE        |                  \
                                 SDIOC_HOST_FLAG_RTA        |                  \
                                 SDIOC_HOST_FLAG_WTA        |                  \
                                 SDIOC_HOST_FLAG_DA         |                  \
                                 SDIOC_HOST_FLAG_CID        |                  \
                                 SDIOC_HOST_FLAG_CIC))))))

#define IS_SDIOC_GET_NORMAL_ERROR_INT_FLAG(x)                                  \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(SDIOC_NORMAL_INT_FLAG_EI   |                  \
                                 SDIOC_NORMAL_INT_FLAG_CINT |                  \
                                 SDIOC_NORMAL_INT_FLAG_CRM  |                  \
                                 SDIOC_NORMAL_INT_FLAG_CIST |                  \
                                 SDIOC_NORMAL_INT_FLAG_BRR  |                  \
                                 SDIOC_NORMAL_INT_FLAG_BWR  |                  \
                                 SDIOC_NORMAL_INT_FLAG_BGE  |                  \
                                 SDIOC_NORMAL_INT_FLAG_TC   |                  \
                                 SDIOC_NORMAL_INT_FLAG_CC   |                  \
                                 SDIOC_ERROR_INT_FLAG_ACE   |                  \
                                 SDIOC_ERROR_INT_FLAG_DEBE  |                  \
                                 SDIOC_ERROR_INT_FLAG_DCE   |                  \
                                 SDIOC_ERROR_INT_FLAG_DTOE  |                  \
                                 SDIOC_ERROR_INT_FLAG_CIE   |                  \
                                 SDIOC_ERROR_INT_FLAG_CEBE  |                  \
                                 SDIOC_ERROR_INT_FLAG_CCE   |                  \
                                 SDIOC_ERROR_INT_FLAG_CTOE))))))

#define IS_SDIOC_CLEAR_NORMAL_ERROR_INT_FLAG(x)                                \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(SDIOC_NORMAL_INT_FLAG_CRM  |                  \
                                 SDIOC_NORMAL_INT_FLAG_CIST |                  \
                                 SDIOC_NORMAL_INT_FLAG_BRR  |                  \
                                 SDIOC_NORMAL_INT_FLAG_BWR  |                  \
                                 SDIOC_NORMAL_INT_FLAG_BGE  |                  \
                                 SDIOC_NORMAL_INT_FLAG_TC   |                  \
                                 SDIOC_NORMAL_INT_FLAG_CC   |                  \
                                 SDIOC_ERROR_INT_FLAG_ACE   |                  \
                                 SDIOC_ERROR_INT_FLAG_DEBE  |                  \
                                 SDIOC_ERROR_INT_FLAG_DCE   |                  \
                                 SDIOC_ERROR_INT_FLAG_DTOE  |                  \
                                 SDIOC_ERROR_INT_FLAG_CIE   |                  \
                                 SDIOC_ERROR_INT_FLAG_CEBE  |                  \
                                 SDIOC_ERROR_INT_FLAG_CCE   |                  \
                                 SDIOC_ERROR_INT_FLAG_CTOE))))))

#define IS_SDIOC_NORMAL_ERROR_INT(x)                                           \
(   (0UL != (x))                                            &&                 \
    (0UL == ((x) & ((uint32_t)(~(SDIOC_NORMAL_INT_CINTSEN   |                  \
                                 SDIOC_NORMAL_INT_CRMSEN    |                  \
                                 SDIOC_NORMAL_INT_CISTSEN   |                  \
                                 SDIOC_NORMAL_INT_BRRSEN    |                  \
                                 SDIOC_NORMAL_INT_BWRSEN    |                  \
                                 SDIOC_NORMAL_INT_BGESEN    |                  \
                                 SDIOC_NORMAL_INT_TCSEN     |                  \
                                 SDIOC_NORMAL_INT_CCSEN     |                  \
                                 SDIOC_ERROR_INT_ACESEN     |                  \
                                 SDIOC_ERROR_INT_DEBESEN    |                  \
                                 SDIOC_ERROR_INT_DCESEN     |                  \
                                 SDIOC_ERROR_INT_DTOESEN    |                  \
                                 SDIOC_ERROR_INT_CIESEN     |                  \
                                 SDIOC_ERROR_INT_CEBESEN    |                  \
                                 SDIOC_ERROR_INT_CCESEN     |                  \
                                 SDIOC_ERROR_INT_CTOESEN))))))

#define IS_SDIOC_AUTO_CMD_ERROR_FLAG(x)                                        \
(   (0U != (x))                                                             && \
    (0U == ((x) & ((uint16_t)(~(uint16_t)(SDIOC_AUTO_CMD_ERROR_FLAG_CMDE    |  \
                                          SDIOC_AUTO_CMD_ERROR_FLAG_IE      |  \
                                          SDIOC_AUTO_CMD_ERROR_FLAG_EBE     |  \
                                          SDIOC_AUTO_CMD_ERROR_FLAG_CE      |  \
                                          SDIOC_AUTO_CMD_ERROR_FLAG_TOE     |  \
                                          SDIOC_AUTO_CMD_ERROR_FLAG_NE))))))

#define IS_SDIOC_FORCE_AUTO_CMD_FLAG(x)                                        \
(   (0U != (x))                                                             && \
    (0U == ((x) & ((uint16_t)(~(uint16_t)(SDIOC_FORCE_AUTO_CMD_ERROR_FCMDE  |  \
                                          SDIOC_FORCE_AUTO_CMD_ERROR_FIE    |  \
                                          SDIOC_FORCE_AUTO_CMD_ERROR_FEBE   |  \
                                          SDIOC_FORCE_AUTO_CMD_ERROR_FCE    |  \
                                          SDIOC_FORCE_AUTO_CMD_ERROR_FTOE   |  \
                                          SDIOC_FORCE_AUTO_CMD_ERROR_FNE))))))

