RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
#define IS_SDIOC_FORCE_ERROR_INT_FLAG(x)                                       \
(   (0U != (x))                                                             && \
    (0U == ((x) & ((uint16_t)(~(uint16_t)(SDIOC_FORCE_ERROR_INT_FACE        |  \
                                          SDIOC_FORCE_ERROR_INT_FDEBE       |  \
                                          SDIOC_FORCE_ERROR_INT_FDCE        |  \
                                          SDIOC_FORCE_ERROR_INT_FDTOE       |  \
                                          SDIOC_FORCE_ERROR_INT_FCIE        |  \
                                          SDIOC_FORCE_ERROR_INT_FCEBE       |  \
                                          SDIOC_FORCE_ERROR_INT_FCCE        |  \
                                          SDIOC_FORCE_ERROR_INT_FCTOE))))))

#define IS_SDIOC_RESOPNE_TYPE(x)                                               \
(   ((x) == SDIOC_RESOPNE_TYPE_NO)              ||                             \
    ((x) == SDIOC_RESOPNE_TYPE_R2)              ||                             \
    ((x) == SDIOC_RESOPNE_TYPE_R3_R4)           ||                             \
    ((x) == SDIOC_RESOPNE_TYPE_R1_R5_R6_R7)     ||                             \
    ((x) == SDIOC_RESOPNE_TYPE_R1B_R5B))

#define IS_SDIOC_CMD_INDEX(x)                   ((x) < 0x40U)

#define IS_SDIOC_BLOCK_SIZE(x)                  (((x) >= 1U) && ((x) <= 512U))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static en_result_t SDMMC_WaitResponse(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32CheckFlag, uint32_t u32Timeout, uint32_t *pu32ErrSta);
static en_result_t SDMMC_GetCmdError(M4_SDIOC_TypeDef *SDIOCx);
static en_result_t SDMMC_GetCmdResp1(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32Timeout, uint32_t *pu32ErrSta);
static en_result_t SDMMC_GetCmdResp1Busy(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32Timeout, uint32_t *pu32ErrSta);
static en_result_t SDMMC_GetCmdResp2(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta);
static en_result_t SDMMC_GetCmdResp3(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta);
static en_result_t SDMMC_GetCmdResp6(M4_SDIOC_TypeDef *SDIOCx, uint16_t *pu16RCA, uint32_t *pu32ErrSta);
static en_result_t SDMMC_GetCmdResp7(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta);

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup SDIOC_Global_Functions SDIOC Global Functions
 * @{
 */
/**
 * @brief  De-Initialize SDIOC.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: SDIOC De-Initialize success
 *           - ErrorTimeout: Software reset timeout
 */
en_result_t SDIOC_DeInit(M4_SDIOC_TypeDef *SDIOCx)
{
    return SDIOC_SoftwareReset(SDIOCx, SDIOC_SW_RESET_ALL);
}

/**
 * @brief  Initialize SDIOC.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] pstcSdiocInit           Pointer to a @ref stc_sdioc_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: SDIOC Initialize success
 *           - ErrorInvalidParameter: pstcSdiocInit == NULL
 */
en_result_t SDIOC_Init(M4_SDIOC_TypeDef *SDIOCx, const stc_sdioc_init_t *pstcSdiocInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcSdiocInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
        DDL_ASSERT(IS_SDIOC_MODE(pstcSdiocInit->u32Mode));
        DDL_ASSERT(IS_SDIOC_CARD_DETECT_SELECT(pstcSdiocInit->u8CardDetectSelect));
        DDL_ASSERT(IS_SDIOC_SPEED_MODE(pstcSdiocInit->u8SpeedMode));
        DDL_ASSERT(IS_SDIOC_BUS_WIDTH(pstcSdiocInit->u8BusWidth));
        DDL_ASSERT(IS_SDIOC_CLOCK_DIV(pstcSdiocInit->u16ClockDiv));

        /* Set the SDIOC mode */
        if (M4_SDIOC1 == SDIOCx)
        {
            WRITE_REG32(bM4_PERIC->SDIOC_SYCTLREG_b.SELMMC1, pstcSdiocInit->u32Mode);
        }
        else
        {
            WRITE_REG32(bM4_PERIC->SDIOC_SYCTLREG_b.SELMMC2, pstcSdiocInit->u32Mode);
        }

        /* Set the SDIOC clock control value */
        WRITE_REG16(SDIOCx->CLKCON, (pstcSdiocInit->u16ClockDiv | SDIOC_CLKCON_ICE | SDIOC_CLKCON_CE));
        /* Set the SDIOC host control value */
        WRITE_REG8(SDIOCx->HOSTCON, (pstcSdiocInit->u8CardDetectSelect |
                                     pstcSdiocInit->u8BusWidth | pstcSdiocInit->u8SpeedMode));
        /* Enable normal interrupt status */
        WRITE_REG16(SDIOCx->NORINTSTEN, SDIOC_NORINTSGEN_CLEAR_MASK);
        /* Enable error interrupt status */
        WRITE_REG16(SDIOCx->ERRINTSTEN, SDIOC_ERRINTSGEN_CLEAR_MASK);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_sdioc_init_t to default values.
 * @param  [out] pstcSdiocInit          Pointer to a @ref stc_sdioc_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcSdiocInit == NULL
 */
en_result_t SDIOC_StructInit(stc_sdioc_init_t *pstcSdiocInit)
{
    en_result_t enRet = Ok;

    if (NULL == pstcSdiocInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcSdiocInit->u32Mode            = SDIOC_MODE_SD;
        pstcSdiocInit->u8CardDetectSelect = SDIOC_CARD_DETECT_CD_PIN_LEVEL;
        pstcSdiocInit->u8SpeedMode        = SDIOC_SPEED_MODE_NORMAL;
        pstcSdiocInit->u8BusWidth         = SDIOC_BUS_WIDTH_1BIT;
        pstcSdiocInit->u16ClockDiv        = SDIOC_CLOCK_DIV_1;
    }

    return enRet;
}

/**
 * @brief  Set software reset.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u8ResetType             Software reset type
 *         This parameter can be one of the following values:
 *           @arg SDIOC_SW_RESET_DATA_LINE: Only part of data circuit is reset
 *           @arg SDIOC_SW_RESET_CMD_LINE:  Only part of command circuit is reset
 *           @arg SDIOC_SW_RESET_ALL:       Reset the entire Host Controller except for the card detection circuit
 * @retval An en_result_t enumeration value:
 *           - Ok: Software reset success
 *           - ErrorTimeout: Software reset timeout
 */
en_result_t SDIOC_SoftwareReset(M4_SDIOC_TypeDef *SDIOCx, uint8_t u8ResetType)
{
    en_result_t enRet = Ok;
    __IO uint32_t u32Count;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_SW_RESET_TYPE(u8ResetType));

    WRITE_REG8(SDIOCx->SFTRST, u8ResetType);
    /* Wait for reset finish */
    u32Count = SDIOC_SW_RESET_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (0U != READ_REG8_BIT(SDIOCx->SFTRST, u8ResetType))
    {
        if (0UL == u32Count)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    return enRet;
}

/**
 * @brief  Enable or disable power.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void SDIOC_PowerCmd(M4_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

