RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (Disable != enNewSta)
    {
        SET_REG8_BIT(SDIOCx->PWRCON, SDIOC_PWRCON_PWON);
    }
    else
    {
        CLEAR_REG8_BIT(SDIOCx->PWRCON, SDIOC_PWRCON_PWON);
    }
}

/**
 * @brief  Get power state.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @retval An en_result_t enumeration value:
 *           - Disable: Power off or SDIOCx == NULL
 *           - Enable: Power on
 */
en_functional_state_t SDIOC_GetPowerState(const M4_SDIOC_TypeDef *SDIOCx)
{
    en_functional_state_t enPowerSta = Disable;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

    if (0U != (READ_REG8_BIT(SDIOCx->PWRCON, SDIOC_PWRCON_PWON)))
    {
        enPowerSta = Enable;
    }

    return enPowerSta;
}

/**
 * @brief  Get SDIOC work mode.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @retval uint32_t value:
 *           - SDIOC_MODE_SD:   SDIOCx selects SD mode
 *           - SDIOC_MODE_MMC:  SDIOCx selects MMC mode
 */
uint32_t SDIOC_GetMode(const M4_SDIOC_TypeDef *SDIOCx)
{
    uint32_t u32SdMode;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

    u32SdMode = READ_REG32_BIT(M4_PERIC->SDIOC_SYCTLREG, ((M4_SDIOC1 == SDIOCx) ?
                                                          PERIC_SDIOC_SYCTLREG_SELMMC1 : PERIC_SDIOC_SYCTLREG_SELMMC2));
    if (0UL != u32SdMode)   /* MMC mode */
    {
        u32SdMode = SDIOC_MODE_MMC;
    }

    return u32SdMode;
}

/**
 * @brief  Enable or disable clock output.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void SDIOC_ClockCmd(M4_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Disable != enNewSta)
    {
        SET_REG8_BIT(SDIOCx->CLKCON, SDIOC_CLKCON_CE);
    }
    else
    {
        CLEAR_REG8_BIT(SDIOCx->CLKCON, SDIOC_CLKCON_CE);
    }
}

/**
 * @brief  Set clock division.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u16ClkDiv               Clock division
 *         This parameter can be one of the following values:
 *           @arg SDIOC_CLOCK_DIV_1:    PCLK1/1
 *           @arg SDIOC_CLOCK_DIV_2:    PCLK1/2
 *           @arg SDIOC_CLOCK_DIV_4:    PCLK1/4
 *           @arg SDIOC_CLOCK_DIV_8:    PCLK1/8
 *           @arg SDIOC_CLOCK_DIV_16:   PCLK1/16
 *           @arg SDIOC_CLOCK_DIV_32:   PCLK1/32
 *           @arg SDIOC_CLOCK_DIV_64:   PCLK1/64
 *           @arg SDIOC_CLOCK_DIV_128:  PCLK1/128
 *           @arg SDIOC_CLOCK_DIV_256:  PCLK1/256
 * @retval None
 */
void SDIOC_SetClockDiv(M4_SDIOC_TypeDef *SDIOCx, uint16_t u16ClkDiv)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_CLOCK_DIV(u16ClkDiv));

    MODIFY_REG16(SDIOCx->CLKCON, SDIOC_CLKCON_FS, u16ClkDiv);
}

/**
 * @brief  Find the most suitable clock division for the set clock frequency.
 * @note   More clock values can be set as needed, but the maximum cannot exceed 50MHz.
 * @param  [in] u32ClkFreq              SDIOCx_CK clock frequency
 *         This parameter can be one of the following values:
 *           @arg SDIOC_OUTPUT_CLK_FREQ_400K:   SDIOC clock: 400KHz
 *           @arg SDIOC_OUTPUT_CLK_FREQ_25M:    SDIOC clock: 25MHz
 *           @arg SDIOC_OUTPUT_CLK_FREQ_26M:    SDIOC clock: 26MHz
 *           @arg SDIOC_OUTPUT_CLK_FREQ_50M:    SDIOC clock: 50MHz
 *           @arg SDIOC_OUTPUT_CLK_FREQ_52M:    SDIOC clock: 52MHz
 *           @arg Any other value
 * @param  [out] pu16ClkDiv             Pointer to a value of clock division
 * @retval An en_result_t enumeration value:
 *           - Ok: SDIOC Initialize success
 *           - Error: The Bus clock frequency is too high
 *           - ErrorInvalidParameter: pu16ClkDiv == NULL or 0UL == u32ClkFreq
 */
en_result_t SDIOC_GetOptimumClockDiv(uint32_t u32ClkFreq, uint16_t *pu16ClkDiv)
{
    en_result_t enRet = Ok;
    uint32_t u32BusClk;
    uint32_t u32ClkDiv;
    uint32_t u32Temp;

    if ((NULL == pu16ClkDiv) || (0UL == u32ClkFreq))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Get PCLK1 frequency */
        u32BusClk = SystemCoreClock / (0x01UL << (READ_REG32_BIT(M4_CMU->SCFGR, CMU_SCFGR_PCLK1S) >> CMU_SCFGR_PCLK1S_POS));
        u32ClkDiv = u32BusClk / u32ClkFreq;
        if (0UL != (u32BusClk % u32ClkFreq))
        {
            u32ClkDiv++;
        }

        /* Check the effectiveness of clock division */
        if (u32ClkDiv > 256U)   /* Maximum division is 256 */
        {
            enRet = Error;
        }
        else
        {
            if (1U == u32ClkDiv)
            {
                *pu16ClkDiv = SDIOC_CLOCK_DIV_1;
            }
            else
            {
                for (u32Temp=SDIOC_CLOCK_DIV_2; u32Temp<=SDIOC_CLOCK_DIV_256; u32Temp<<=1U)
                {
                    if (u32ClkDiv <= (u32Temp >> (SDIOC_CLKCON_FS_POS - 1U)))
                    {
                        break;
                    }
                }
                *pu16ClkDiv = (uint16_t)u32Temp;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Verify the validity of the clock division.
 * @param  [in] u32Mode                 SDIOC work mode
 *         This parameter can be one of the following values:
 *           @arg SDIOC_MODE_SD:        SDIOCx selects SD mode
 *           @arg SDIOC_MODE_MMC:       SDIOCx selects MMC mode
 * @param  [in] u8SpeedMode             Speed mode
 *         This parameter can be one of the following values:
 *           @arg SDIOC_SPEED_MODE_NORMAL:  Normal speed mode
 *           @arg SDIOC_SPEED_MODE_HIGH:    High speed mode
 * @param  [in] u16ClkDiv               Clock division
 *         This parameter can be one of the following values:
 *           @arg SDIOC_CLOCK_DIV_1:    PCLK1/1
 *           @arg SDIOC_CLOCK_DIV_2:    PCLK1/2
 *           @arg SDIOC_CLOCK_DIV_4:    PCLK1/4
 *           @arg SDIOC_CLOCK_DIV_8:    PCLK1/8
 *           @arg SDIOC_CLOCK_DIV_16:   PCLK1/16
 *           @arg SDIOC_CLOCK_DIV_32:   PCLK1/32
 *           @arg SDIOC_CLOCK_DIV_64:   PCLK1/64
 *           @arg SDIOC_CLOCK_DIV_128:  PCLK1/128
 *           @arg SDIOC_CLOCK_DIV_256:  PCLK1/256
 * @retval An en_result_t enumeration value:
 *           - Ok: The clock division is valid
 *           - Error: The Bus clock frequency is too high
 */
en_result_t SDIOC_VerifyClockDiv(uint32_t u32Mode, uint8_t u8SpeedMode, uint16_t u16ClkDiv)
{
    en_result_t enRet = Ok;
    uint32_t u32BusClk;
    uint32_t u32ClkFreq;
    uint32_t u32MaxFreq;
    uint32_t u32DivValue;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_MODE(u32Mode));
    DDL_ASSERT(IS_SDIOC_SPEED_MODE(u8SpeedMode));
    DDL_ASSERT(IS_SDIOC_CLOCK_DIV(u16ClkDiv));

    /* Get PCLK1 frequency */
    u32BusClk = SystemCoreClock / (0x01UL << (READ_REG32_BIT(M4_CMU->SCFGR, CMU_SCFGR_PCLK1S) >> CMU_SCFGR_PCLK1S_POS));
    u32DivValue = ((uint32_t)u16ClkDiv >> (SDIOC_CLKCON_FS_POS - 1U));
    if (0UL == u32DivValue)
    {
        u32ClkFreq = u32BusClk;
    }
    else
    {
        u32ClkFreq = u32BusClk / u32DivValue;
    }

    if (SDIOC_SPEED_MODE_NORMAL == u8SpeedMode)
    {
        if (SDIOC_MODE_SD != u32Mode)   /* MMC mode */
        {
            u32MaxFreq = SDIOC_OUTPUT_CLK_FREQ_26M;
        }
        else
        {
            u32MaxFreq = SDIOC_OUTPUT_CLK_FREQ_25M;
        }
    }
    else
    {
        if (SDIOC_MODE_SD != u32Mode)   /* MMC mode */
        {
            u32MaxFreq = SDIOC_OUTPUT_CLK_FREQ_52M;
        }
        else
        {
            u32MaxFreq = SDIOC_OUTPUT_CLK_FREQ_50M;
        }
    }

    if (u32ClkFreq > u32MaxFreq)
    {
        enRet = Error;
    }

    return enRet;
}

/**
 * @brief  Get device insert state.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @retval An en_result_t enumeration value:
 *           - Disable: No device inserted
 *           - Enable:  The device inserted
 */
en_functional_state_t SDIOC_GetDeviceInsertState(const M4_SDIOC_TypeDef *SDIOCx)
{
    en_functional_state_t enInsertSta = Disable;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

    if (0UL != (READ_REG32_BIT(SDIOCx->PSTAT, SDIOC_PSTAT_CSS)))
    {
        if (0UL != (READ_REG32_BIT(SDIOCx->PSTAT, SDIOC_PSTAT_CIN)))
        {
            enInsertSta = Enable;
        }
    }

    return enInsertSta;
}

/**
 * @brief  Set speed mode.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u8SpeedMode             Speed mode
 *         This parameter can be one of the following values:
 *           @arg SDIOC_SPEED_MODE_NORMAL:  Normal speed mode
 *           @arg SDIOC_SPEED_MODE_HIGH:    High speed mode
 * @retval None
 */
void SDIOC_SetSpeedMode(M4_SDIOC_TypeDef *SDIOCx, uint8_t u8SpeedMode)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_SPEED_MODE(u8SpeedMode));

    if (SDIOC_SPEED_MODE_NORMAL != u8SpeedMode)
    {
        SET_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_HSEN);
    }
    else
    {
        CLEAR_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_HSEN);
    }
}

/**
 * @brief  Set bus width.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u8BusWidth              Bus width
 *         This parameter can be one of the following values:
 *           @arg SDIOC_BUS_WIDTH_1BIT: The Bus width is 1 bit
 *           @arg SDIOC_BUS_WIDTH_4BIT: The Bus width is 4 bit
 *           @arg SDIOC_BUS_WIDTH_8BIT: The Bus width is 8 bit
 * @retval None
 */
void SDIOC_SetBusWidth(M4_SDIOC_TypeDef *SDIOCx, uint8_t u8BusWidth)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_BUS_WIDTH(u8BusWidth));

