RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    MODIFY_REG8(SDIOCx->HOSTCON, (SDIOC_HOSTCON_DW | SDIOC_HOSTCON_EXDW), u8BusWidth);
}

/**
 * @brief  Set card detect line select.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u8Src                   Card detect source
 *         This parameter can be one of the following values:
 *           @arg SDIOC_CARD_DETECT_CD_PIN_LEVEL:   SDIOCx_CD(x=1~2) line is selected (for normal use)
 *           @arg SDIOC_CARD_DETECT_TEST_SIGNAL:    The Card Detect Test Level is selected(for test purpose)
 * @retval None
 */
void SDIOC_SetCardDetectSource(M4_SDIOC_TypeDef *SDIOCx, uint8_t u8Src)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_CARD_DETECT_SELECT(u8Src));

    if (SDIOC_CARD_DETECT_CD_PIN_LEVEL != u8Src)
    {
        SET_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_CDSS);
    }
    else
    {
        CLEAR_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_CDSS);
    }
}

/**
 * @brief  Set card detect test level.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u8Level                 Card test level
 *         This parameter can be one of the following values:
 *           @arg SDIOC_CARD_DETECT_TEST_LEVEL_LOW:     Card identification test signal is low level (with device insertion)
 *           @arg SDIOC_CARD_DETECT_TEST_LEVEL_HIGH:    Card identification test signal is high level (no device insertion)
 * @retval None
 */
void SDIOC_SetCardDetectTestLevel(M4_SDIOC_TypeDef *SDIOCx, uint8_t u8Level)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_CARD_DETECT_TEST_LEVEL(u8Level));

    if (SDIOC_CARD_DETECT_TEST_LEVEL_LOW != u8Level)
    {
        SET_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_CDTL);
    }
    else
    {
        CLEAR_REG8_BIT(SDIOCx->HOSTCON, SDIOC_HOSTCON_CDTL);
    }
}

/**
 * @brief  Configure the SDIOCx command parameters.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] pstcCmd                 Pointer to a @ref stc_sdioc_cmd_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure SDIOCx command parameters success
 *           - ErrorInvalidParameter: pstcCmd == NULL
 */
en_result_t SDIOC_SendCommand(M4_SDIOC_TypeDef *SDIOCx, const stc_sdioc_cmd_init_t *pstcCmd)
{
    en_result_t enRet = Ok;
    __IO uint32_t *pu32Temp;

    if (NULL == pstcCmd)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
        DDL_ASSERT(IS_SDIOC_CMD_INDEX(pstcCmd->u16CmdIndex));
        DDL_ASSERT(IS_SDIOC_CMD_TYPE(pstcCmd->u16CmdType));
        DDL_ASSERT(IS_SDIOC_DATA_LINE(pstcCmd->u16DataLineEn));
        DDL_ASSERT(IS_SDIOC_RESOPNE_TYPE(pstcCmd->u16RespType));

        /* Set the SDIOC Command parameters value */
        pu32Temp = (__IO uint32_t *)SDIOC_ARG(SDIOCx);
        WRITE_REG32(*pu32Temp, pstcCmd->u32Argument);
        /* Set the SDIOC Command controller value */
        WRITE_REG16(SDIOCx->CMD, ((uint16_t)(pstcCmd->u16CmdIndex << SDIOC_CMD_IDX_POS) |
                                  pstcCmd->u16CmdType | pstcCmd->u16DataLineEn | pstcCmd->u16RespType));
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_sdioc_cmd_init_t to default values.
 * @param  [out] pstcCmd                Pointer to a @ref stc_sdioc_cmd_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcData == NULL
 */
en_result_t SDIOC_CmdStructInit(stc_sdioc_cmd_init_t *pstcCmd)
{
    en_result_t enRet = Ok;

    if (NULL == pstcCmd)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcCmd->u32Argument   = 0U;
        pstcCmd->u16CmdIndex   = 0U;
        pstcCmd->u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        pstcCmd->u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        pstcCmd->u16RespType   = SDIOC_RESOPNE_TYPE_NO;
    }

    return enRet;
}

/**
 * @brief  Get the response received from the card for the last command
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u8RespReg               SDIOC response register
 *         This parameter can be one of the following values:
 *           @arg SDIOC_RESPONSE_REG_BIT0_31:   Command Response Register 0-31bit
 *           @arg SDIOC_RESPONSE_REG_BIT32_63:  Command Response Register 32-63bit
 *           @arg SDIOC_RESPONSE_REG_BIT64_95:  Command Response Register 64-95bit
 *           @arg SDIOC_RESPONSE_REG_BIT96_127: Command Response Register 96-127bit
 * @param  [out] pu32RespVal            Pointer to a Response value
 * @retval An en_result_t enumeration value:
 *           - Ok: Get response success
 *           - ErrorInvalidParameter: pu32RespVal == NULL
 */
en_result_t SDIOC_GetResponse(M4_SDIOC_TypeDef *SDIOCx, uint8_t u8RespReg, uint32_t *pu32RespVal)
{
    en_result_t enRet = Ok;

    if (NULL == pu32RespVal)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
        DDL_ASSERT(IS_SDIOC_RESPONSE_REG(u8RespReg));

        *pu32RespVal = READ_REG32(*(__IO uint32_t *)SDIOC_RESPx(SDIOCx, u8RespReg));
    }

    return enRet;
}

/**
 * @brief  Configure the SDIOCx data parameters.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] pstcData                Pointer to a @ref stc_sdioc_data_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure SDIOCx data parameters success
 *           - ErrorInvalidParameter: pstcData == NULL
 */
en_result_t SDIOC_ConfigData(M4_SDIOC_TypeDef *SDIOCx, const stc_sdioc_data_init_t *pstcData)
{
    en_result_t enRet = Ok;
    uint16_t u16BlkCnt;

