RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (NULL == pstcData)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
        DDL_ASSERT(IS_SDIOC_BLOCK_SIZE(pstcData->u16BlockSize));
        DDL_ASSERT(IS_SDIOC_TRANSFER_DIR(pstcData->u16TransferDir));
        DDL_ASSERT(IS_SDIOC_AUTO_SEND_CMD12(pstcData->u16AutoCMD12En));
        DDL_ASSERT(IS_SDIOC_TRANSFER_MODE(pstcData->u16TransferMode));
        DDL_ASSERT(IS_SDIOC_DATA_TIMEOUT_TIME(pstcData->u16DataTimeout));

        if (SDIOC_TRANSFER_MODE_STOP_MULTIPLE == pstcData->u16TransferMode)
        {
            u16BlkCnt = 0U;
        }
        else
        {
            u16BlkCnt = pstcData->u16BlockCount;
        }

        /* Set the SDIOC Data Transfer Timeout value */
        WRITE_REG8(SDIOCx->TOUTCON, pstcData->u16DataTimeout);
        /* Set the SDIOC Block Count value */
        WRITE_REG16(SDIOCx->BLKSIZE, pstcData->u16BlockSize);
        /* Set the SDIOC Block Size value */
        WRITE_REG16(SDIOCx->BLKCNT,u16BlkCnt);
        /* Set the SDIOC Data Transfer Mode */
        WRITE_REG16(SDIOCx->TRANSMODE, ((pstcData->u16TransferDir |
                                        pstcData->u16AutoCMD12En | pstcData->u16TransferMode) & 0x00FFU));
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_sdioc_data_init_t to default values.
 * @param  [out] pstcData               Pointer to a @ref stc_sdioc_data_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Structure Initialize success
 *           - ErrorInvalidParameter: pstcData == NULL
 */
en_result_t SDIOC_DataStructInit(stc_sdioc_data_init_t *pstcData)
{
    en_result_t enRet = Ok;

    if (NULL == pstcData)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcData->u16BlockSize    = 512U;
        pstcData->u16BlockCount   = 0U;
        pstcData->u16TransferDir  = SDIOC_TRANSFER_DIR_TO_CARD;
        pstcData->u16AutoCMD12En  = SDIOC_AUTO_SEND_CMD12_DISABLE;
        pstcData->u16TransferMode = SDIOC_TRANSFER_MODE_SINGLE;
        pstcData->u16DataTimeout  = SDIOC_DATA_TIMEOUT_CLK_2_13;
    }

    return enRet;
}

/**
 * @brief  Read data from SDIOC FIFO.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] au8Data                Pointer to the buffer
 * @param  [in] u32Len                  Data length
 * @retval An en_result_t enumeration value:
 *           - Ok: Read data success
 *           - ErrorInvalidParameter: NULL == au8Data or (u32Len % 4U) != 0
 */
en_result_t SDIOC_ReadBuffer(M4_SDIOC_TypeDef *SDIOCx, uint8_t au8Data[], uint32_t u32Len)
{
    en_result_t enRet = Ok;
    uint32_t i;
    uint32_t u32Temp;
    __IO uint32_t *BUF_REG;

    if ((NULL == au8Data) || (0U != (u32Len % 4U)))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

        BUF_REG = (__IO uint32_t *)SDIOC_BUF(SDIOCx);
        for (i = 0U; i < u32Len; i += 4U)
        {
            u32Temp = READ_REG32(*BUF_REG);
            au8Data[i]    = (uint8_t)(u32Temp & 0x000000FFUL);
            au8Data[i+1U] = (uint8_t)((u32Temp >> 8U) & 0x000000FFUL);
            au8Data[i+2U] = (uint8_t)((u32Temp >> 16U) & 0x000000FFUL);
            au8Data[i+3U] = (uint8_t)((u32Temp >> 24U) & 0x000000FFUL);
        }
    }

    return enRet;
}

/**
 * @brief  Write data to SDIOC FIFO.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] au8Data                 Pointer to the buffer
 * @param  [in] u32Len                  Data length
 * @retval An en_result_t enumeration value:
 *           - Ok: Write data success
 *           - ErrorInvalidParameter: NULL == au8Data or (u32Len % 4U) != 0
 */
en_result_t SDIOC_WriteBuffer(M4_SDIOC_TypeDef *SDIOCx, const uint8_t au8Data[], uint32_t u32Len)
{
    en_result_t enRet = Ok;
    uint32_t i;
    uint32_t u32Temp;
    __IO uint32_t *BUF_REG;

    if ((NULL == au8Data) || (0U != (u32Len % 4U)))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

        BUF_REG = (__IO uint32_t *)SDIOC_BUF(SDIOCx);
        for (i = 0U; i < u32Len; i += 4U)
        {
            u32Temp = (uint32_t)au8Data[i]             | ((uint32_t)au8Data[i+1U] << 8U) |
                      ((uint32_t)au8Data[i+2U] << 16U) | ((uint32_t)au8Data[i+3U] << 24U);
            WRITE_REG32(*BUF_REG, u32Temp);
        }
    }

    return enRet;
}

/**
 * @brief  Enable or disable block gap stop.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void SDIOC_BlockGapStopCmd(M4_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Disable != enNewSta)
    {
        SET_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_SABGR);
    }
    else
    {
        CLEAR_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_SABGR);
    }
}

/**
 * @brief  Restart data transfer.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @retval None
 */
void SDIOC_RestartTransfer(M4_SDIOC_TypeDef *SDIOCx)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));

    SET_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_CR);
}

/**
 * @brief  Enable or disable read wait.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void SDIOC_ReadWaitCmd(M4_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

