RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (Disable != enNewSta)
    {
        SET_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_RWC);
    }
    else
    {
        CLEAR_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_RWC);
    }
}

/**
 * @brief  Enable or disable data block gap interrupt.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void SDIOC_BlockGapInterruptCmd(M4_SDIOC_TypeDef *SDIOCx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Disable != enNewSta)
    {
        SET_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_IABG);
    }
    else
    {
        CLEAR_REG8_BIT(SDIOCx->BLKGPCON, SDIOC_BLKGPCON_IABG);
    }
}

/**
 * @brief  Enable or disable interrupt.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32IntSrc               Normal and error interrupts source
 *         This parameter can be one or any combination of the following values:
 *           @arg SDIOC_NORMAL_INT_CINTSEN:     Card Interrupt
 *           @arg SDIOC_NORMAL_INT_CRMSEN:      Card Removal Interrupt
 *           @arg SDIOC_NORMAL_INT_CISTSEN:     Card Insertion Interrupt
 *           @arg SDIOC_NORMAL_INT_BRRSEN:      Buffer Read Ready Interrupt
 *           @arg SDIOC_NORMAL_INT_BWRSEN:      Buffer Write Ready Interrupt
 *           @arg SDIOC_NORMAL_INT_BGESEN:      Block Gap Event Interrupt
 *           @arg SDIOC_NORMAL_INT_TCSEN:       Transfer Complete Interrupt
 *           @arg SDIOC_NORMAL_INT_CCSEN:       Command Complete Interrupt
 *           @arg SDIOC_ERROR_INT_ACESEN:       Auto CMD12 Error Interrupt
 *           @arg SDIOC_ERROR_INT_DEBESEN:      Data End Bit Error Interrupt
 *           @arg SDIOC_ERROR_INT_DCESEN:       Data CRC Error Interrupt
 *           @arg SDIOC_ERROR_INT_DTOESEN:      Data Timeout Error Interrupt
 *           @arg SDIOC_ERROR_INT_CIESEN:       Command Index Error Interrupt
 *           @arg SDIOC_ERROR_INT_CEBESEN:      Command End Bit Error Interrupt
 *           @arg SDIOC_ERROR_INT_CCESEN:       Command CRC Error Interrupt
 *           @arg SDIOC_ERROR_INT_CTOESEN:      Command Timeout Error Interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void SDIOC_IntCmd(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32IntSrc, en_functional_state_t enNewSta)
{
    uint16_t u16NormalInt;
    uint16_t u16ErrorInt;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_NORMAL_ERROR_INT(u32IntSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    u16NormalInt = (uint16_t)(u32IntSrc & 0xFFFFU);
    u16ErrorInt  = (uint16_t)((u32IntSrc >> 16U) & 0xFFFFU);

    if (Disable != enNewSta)
    {
        if (0U != u16NormalInt)
        {
            SET_REG16_BIT(SDIOCx->NORINTSGEN, u16NormalInt);
        }
        if (0U != u16ErrorInt)
        {
            SET_REG16_BIT(SDIOCx->ERRINTSGEN, u16ErrorInt);
        }
    }
    else
    {
        if (0U != u16NormalInt)
        {
            CLEAR_REG16_BIT(SDIOCx->NORINTSGEN, u16NormalInt);
        }
        if (0U != u16ErrorInt)
        {
            CLEAR_REG16_BIT(SDIOCx->ERRINTSGEN, u16ErrorInt);
        }
    }
}

/**
 * @brief  Get interrupt enable state.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32IntSrc               Normal and error interrupts source
 *         This parameter can be one or any combination of the following values:
 *           @arg SDIOC_NORMAL_INT_CINTSEN:     Card Interrupt
 *           @arg SDIOC_NORMAL_INT_CRMSEN:      Card Removal Interrupt
 *           @arg SDIOC_NORMAL_INT_CISTSEN:     Card Insertion Interrupt
 *           @arg SDIOC_NORMAL_INT_BRRSEN:      Buffer Read Ready Interrupt
 *           @arg SDIOC_NORMAL_INT_BWRSEN:      Buffer Write Ready Interrupt
 *           @arg SDIOC_NORMAL_INT_BGESEN:      Block Gap Event Interrupt
 *           @arg SDIOC_NORMAL_INT_TCSEN:       Transfer Complete Interrupt
 *           @arg SDIOC_NORMAL_INT_CCSEN:       Command Complete Interrupt
 *           @arg SDIOC_ERROR_INT_ACESEN:       Auto CMD12 Error Interrupt
 *           @arg SDIOC_ERROR_INT_DEBESEN:      Data End Bit Error Interrupt
 *           @arg SDIOC_ERROR_INT_DCESEN:       Data CRC Error Interrupt
 *           @arg SDIOC_ERROR_INT_DTOESEN:      Data Timeout Error Interrupt
 *           @arg SDIOC_ERROR_INT_CIESEN:       Command Index Error Interrupt
 *           @arg SDIOC_ERROR_INT_CEBESEN:      Command End Bit Error Interrupt
 *           @arg SDIOC_ERROR_INT_CCESEN:       Command CRC Error Interrupt
 *           @arg SDIOC_ERROR_INT_CTOESEN:      Command Timeout Error Interrupt
 * @retval An en_functional_state_t enumeration value:
 *           - Enable: The interrupt is enable
 *           - Disable: The interrupt is disable
 */
en_functional_state_t SDIOC_GetIntEnableState(const M4_SDIOC_TypeDef *SDIOCx, uint32_t u32IntSrc)
{
    uint16_t u16NormalInt;
    uint16_t u16ErrorInt;
    en_functional_state_t enIntSta = Disable;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_NORMAL_ERROR_INT(u32IntSrc));

    u16NormalInt = (uint16_t)(u32IntSrc & 0xFFFFU);
    u16ErrorInt  = (uint16_t)((u32IntSrc >> 16U) & 0xFFFFU);

