RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (0U != u16NormalInt)
    {
        if (0U != (READ_REG16_BIT(SDIOCx->NORINTSGEN, u16NormalInt)))
        {
            enIntSta = Enable;
        }
    }
    if (0U != u16ErrorInt)
    {
        if (0U != (READ_REG16_BIT(SDIOCx->ERRINTSGEN, u16ErrorInt)))
        {
            enIntSta = Enable;
        }
    }

    return enIntSta;
}

/**
 * @brief  Get interrupt flag status.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32Flag                 Normal and error interrupts flag
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_NORMAL_INT_FLAG_EI:     Error Interrupt Status
 *           @arg SDIOC_NORMAL_INT_FLAG_CINT:   Card Interrupt status
 *           @arg SDIOC_NORMAL_INT_FLAG_CRM:    Card Removal status
 *           @arg SDIOC_NORMAL_INT_FLAG_CIST:   Card Insertion status
 *           @arg SDIOC_NORMAL_INT_FLAG_BRR:    Buffer Read Ready status
 *           @arg SDIOC_NORMAL_INT_FLAG_BWR:    Buffer Write Ready status
 *           @arg SDIOC_NORMAL_INT_FLAG_BGE:    Block Gap Event status
 *           @arg SDIOC_NORMAL_INT_FLAG_TC:     Transfer Complete status
 *           @arg SDIOC_NORMAL_INT_FLAG_CC:     Command Complete status
 *           @arg SDIOC_ERROR_INT_FLAG_ACE:     Auto CMD12 Error Status
 *           @arg SDIOC_ERROR_INT_FLAG_DEBE:    Data End Bit Error status
 *           @arg SDIOC_ERROR_INT_FLAG_DCE:     Data CRC Error status
 *           @arg SDIOC_ERROR_INT_FLAG_DTOE:    Data Timeout Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CIE:     Command Index Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CEBE:    Command End Bit Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CCE:     Command CRC Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CTOE:    Command Timeout Error status
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t SDIOC_GetIntStatus(const M4_SDIOC_TypeDef *SDIOCx, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;
    uint16_t u16NormalFlag;
    uint16_t u16ErrorFlag;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_GET_NORMAL_ERROR_INT_FLAG(u32Flag));

    u16NormalFlag = (uint16_t)(u32Flag & 0xFFFFU);
    u16ErrorFlag  = (uint16_t)((u32Flag >> 16U) & 0xFFFFU);

    if (0U != u16NormalFlag)
    {
        if (0U != (READ_REG16_BIT(SDIOCx->NORINTST, u16NormalFlag)))
        {
            enFlagSta = Set;
        }
    }
    if (0U != u16ErrorFlag)
    {
        if (0U != (READ_REG16_BIT(SDIOCx->ERRINTST, u16ErrorFlag)))
        {
            enFlagSta = Set;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Clear interrupt flag status.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32Flag                 Normal and error interrupts flag
 *         This parameter can be one or any combination of the following values:
 *           @arg SDIOC_NORMAL_INT_FLAG_CRM:    Card Removal status
 *           @arg SDIOC_NORMAL_INT_FLAG_CIST:   Card Insertion status
 *           @arg SDIOC_NORMAL_INT_FLAG_BRR:    Buffer Read Ready status
 *           @arg SDIOC_NORMAL_INT_FLAG_BWR:    Buffer Write Ready status
 *           @arg SDIOC_NORMAL_INT_FLAG_BGE:    Block Gap Event status
 *           @arg SDIOC_NORMAL_INT_FLAG_TC:     Transfer Complete status
 *           @arg SDIOC_NORMAL_INT_FLAG_CC:     Command Complete status
 *           @arg SDIOC_ERROR_INT_FLAG_ACE:     Auto CMD12 Error Status
 *           @arg SDIOC_ERROR_INT_FLAG_DEBE:    Data End Bit Error status
 *           @arg SDIOC_ERROR_INT_FLAG_DCE:     Data CRC Error status
 *           @arg SDIOC_ERROR_INT_FLAG_DTOE:    Data Timeout Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CIE:     Command Index Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CEBE:    Command End Bit Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CCE:     Command CRC Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CTOE:    Command Timeout Error status
 * @retval None
 */
void SDIOC_ClearIntStatus(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32Flag)
{
    uint16_t u16NormalFlag;
    uint16_t u16ErrorFlag;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_CLEAR_NORMAL_ERROR_INT_FLAG(u32Flag));

    u16NormalFlag = (uint16_t)(u32Flag & 0xFFFFU);
    u16ErrorFlag  = (uint16_t)((u32Flag >> 16U) & 0xFFFFU);
    if (0U != u16NormalFlag)
    {
        WRITE_REG16(SDIOCx->NORINTST, u16NormalFlag);
    }
    if (0U != u16ErrorFlag)
    {
        WRITE_REG16(SDIOCx->ERRINTST, u16ErrorFlag);
    }
}

/**
 * @brief  Enable or disable interrupt status.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32IntSrc               Normal and error interrupts source
 *         This parameter can be one or any combination of the following values:
 *           @arg SDIOC_NORMAL_INT_CINTSEN:     Card Interrupt
 *           @arg SDIOC_NORMAL_INT_CRMSEN:      Card Removal Interrupt
 *           @arg SDIOC_NORMAL_INT_CISTSEN:     Card Insertion Interrupt
 *           @arg SDIOC_NORMAL_INT_BRRSEN:      Buffer Read Ready Interrupt
 *           @arg SDIOC_NORMAL_INT_BWRSEN:      Buffer Write Ready Interrupt
 *           @arg SDIOC_NORMAL_INT_BGESEN:      Block Gap Event Interrupt
 *           @arg SDIOC_NORMAL_INT_TCSEN:       Transfer Complete Interrupt
 *           @arg SDIOC_NORMAL_INT_CCSEN:       Command Complete Interrupt
 *           @arg SDIOC_ERROR_INT_ACESEN:       Auto CMD12 Error Interrupt
 *           @arg SDIOC_ERROR_INT_DEBESEN:      Data End Bit Error Interrupt
 *           @arg SDIOC_ERROR_INT_DCESEN:       Data CRC Error Interrupt
 *           @arg SDIOC_ERROR_INT_DTOESEN:      Data Timeout Error Interrupt
 *           @arg SDIOC_ERROR_INT_CIESEN:       Command Index Error Interrupt
 *           @arg SDIOC_ERROR_INT_CEBESEN:      Command End Bit Error Interrupt
 *           @arg SDIOC_ERROR_INT_CCESEN:       Command CRC Error Interrupt
 *           @arg SDIOC_ERROR_INT_CTOESEN:      Command Timeout Error Interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void SDIOC_IntStatusCmd(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32IntSrc, en_functional_state_t enNewSta)
{
    uint16_t u16NormalInt;
    uint16_t u16ErrorInt;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_NORMAL_ERROR_INT(u32IntSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    u16NormalInt = (uint16_t)(u32IntSrc & 0xFFFFU);
    u16ErrorInt  = (uint16_t)((u32IntSrc >> 16U) & 0xFFFFU);

