RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (Disable != enNewSta)
    {
        if (0U != u16NormalInt)
        {
            SET_REG16_BIT(SDIOCx->NORINTSTEN, u16NormalInt);
        }
        if (0U != u16ErrorInt)
        {
            SET_REG16_BIT(SDIOCx->ERRINTSTEN, u16ErrorInt);
        }
    }
    else
    {
        if (0U != u16NormalInt)
        {
            CLEAR_REG16_BIT(SDIOCx->NORINTSTEN, u16NormalInt);
        }
        if (0U != u16ErrorInt)
        {
            CLEAR_REG16_BIT(SDIOCx->ERRINTSTEN, u16ErrorInt);
        }
    }
}

/**
 * @brief  Get Host status.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32Flag                 Host flag
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_HOST_FLAG_CMDL:     CMD Line Level status
 *           @arg SDIOC_HOST_FLAG_DATL:     DAT[3:0] Line Level status
 *           @arg SDIOC_HOST_FLAG_DATL_D0:  DAT[0] Line Level status
 *           @arg SDIOC_HOST_FLAG_DATL_D1:  DAT[1] Line Level status
 *           @arg SDIOC_HOST_FLAG_DATL_D2:  DAT[2] Line Level status
 *           @arg SDIOC_HOST_FLAG_DATL_D3:  DAT[3] Line Level status
 *           @arg SDIOC_HOST_FLAG_WPL:      Write Protect Line Level status
 *           @arg SDIOC_HOST_FLAG_CDL:      Card Detect Line Level status
 *           @arg SDIOC_HOST_FLAG_CSS:      Device Stable Status
 *           @arg SDIOC_HOST_FLAG_CIN:      Device Inserted status
 *           @arg SDIOC_HOST_FLAG_BRE:      Data buffer full status
 *           @arg SDIOC_HOST_FLAG_BWE:      Data buffer empty status
 *           @arg SDIOC_HOST_FLAG_RTA:      Read operation status
 *           @arg SDIOC_HOST_FLAG_WTA:      Write operation status
 *           @arg SDIOC_HOST_FLAG_DA:       DAT Line transfer status
 *           @arg SDIOC_HOST_FLAG_CID:      Command Inhibit with data status
 *           @arg SDIOC_HOST_FLAG_CIC:      Command Inhibit status
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t SDIOC_GetHostStatus(const M4_SDIOC_TypeDef *SDIOCx, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_GET_HOST_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(SDIOCx->PSTAT, u32Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Get auto CMD12 error status.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u16Flag                 Auto CMD12 error flag
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_AUTO_CMD_ERROR_FLAG_CMDE:   Command Not Issued By Auto CMD12 Error Status
 *           @arg SDIOC_AUTO_CMD_ERROR_FLAG_IE:     Auto CMD12 Index Error status
 *           @arg SDIOC_AUTO_CMD_ERROR_FLAG_EBE:    Auto CMD12 End Bit Error status
 *           @arg SDIOC_AUTO_CMD_ERROR_FLAG_CE:     Auto CMD12 CRC Error status
 *           @arg SDIOC_AUTO_CMD_ERROR_FLAG_TOE:    Auto CMD12 Timeout Error status
 *           @arg SDIOC_AUTO_CMD_ERROR_FLAG_NE:     Auto CMD12 Not Executed status
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t SDIOC_GetAutoCmdErrorStatus(const M4_SDIOC_TypeDef *SDIOCx, uint16_t u16Flag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_AUTO_CMD_ERROR_FLAG(u16Flag));

    if (0U != (READ_REG16_BIT(SDIOCx->ATCERRST, u16Flag)))
    {
        enFlagSta = Set;
    }

    return enFlagSta;
}

/**
 * @brief  Force the specified auto CMD12 error event flag.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u16CmdFlag              Auto CMD12 error flag
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_FORCE_AUTO_CMD_ERROR_FCMDE: Force Event for Command Not Issued By Auto CMD12 Error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERROR_FIE:   Force Event for Auto CMD12 Index Error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERROR_FEBE:  Force Event for Auto CMD12 End Bit Error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERROR_FCE:   Force Event for Auto CMD12 CRC Error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERROR_FTOE:  Force Event for Auto CMD12 Timeout Error
 *           @arg SDIOC_FORCE_AUTO_CMD_ERROR_FNE:   Force Event for Auto CMD12 Not Executed
 * @retval None
 */
void SDIOC_ForceAutoCmdErrorEvent(M4_SDIOC_TypeDef *SDIOCx, uint16_t u16CmdFlag)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_FORCE_AUTO_CMD_FLAG(u16CmdFlag));

    WRITE_REG16(SDIOCx->FEA, u16CmdFlag);
}

/**
 * @brief  Force the specified error interrupt event flag.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u16IntFlag              Error interrupt flag
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_FORCE_ERROR_INT_FACE:   Force Event for Auto CMD12 Error
 *           @arg SDIOC_FORCE_ERROR_INT_FDEBE:  Force Event for Data End Bit Error
 *           @arg SDIOC_FORCE_ERROR_INT_FDCE:   Force Event for Data CRC Error
 *           @arg SDIOC_FORCE_ERROR_INT_FDTOE:  Force Event for Data Timeout Error
 *           @arg SDIOC_FORCE_ERROR_INT_FCIE:   Force Event for Command Index Error
 *           @arg SDIOC_FORCE_ERROR_INT_FCEBE:  Force Event for Command End Bit Error
 *           @arg SDIOC_FORCE_ERROR_INT_FCCE:   Force Event for Command CRC Error
 *           @arg SDIOC_FORCE_ERROR_INT_FCTOE:  Force Event for Command Timeout Error
 * @retval None
 */
void SDIOC_ForceErrorInterruptEvent(M4_SDIOC_TypeDef *SDIOCx, uint16_t u16IntFlag)
{
    /* Check parameters */
    DDL_ASSERT(IS_SDIOC_UNIT(SDIOCx));
    DDL_ASSERT(IS_SDIOC_FORCE_ERROR_INT_FLAG(u16IntFlag));

    WRITE_REG16(SDIOCx->FEE, u16IntFlag);
}

/**
 * @brief  Send the Go Idle State command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD0_GoIdleState(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

