RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        *pu32ErrSta              = SDMMC_ERROR_NONE;
        stcCmdInit.u32Argument   = 0UL;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD0_GO_IDLE_STATE;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_NO;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdError(SDIOCx);
        }
    }

    return enRet;
}

/**
 * @brief  Send the Send CID command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD2_AllSendCID(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = 0UL;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD2_ALL_SEND_CID;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R2;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
         if (Ok == enRet)
         {
             enRet = SDMMC_GetCmdResp2(SDIOCx, pu32ErrSta);
         }
    }

    return enRet;
}

/**
 * @brief  Send the command for asking the card to publish a new relative address(RCA).
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu16RCA                Pointer to the new RCA value
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu16RCA == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD3_SendRelativeAddr(M4_SDIOC_TypeDef *SDIOCx, uint16_t *pu16RCA, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

    if ((NULL == pu16RCA) || (NULL == pu32ErrSta))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = 0UL;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD3_SEND_RELATIVE_ADDR;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1_R5_R6_R7;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdResp6(SDIOCx, pu16RCA, pu32ErrSta);
        }
    }

    return enRet;
}

/**
 * @brief  Checks switchable function and switch card function.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32Argument             Argument used for the command.
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD6_SwitchFunc(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32Argument, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;
    uint32_t u32SdMode;

    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument = u32Argument;
        stcCmdInit.u16CmdIndex = SDIOC_CMD6_SWITCH_FUNC;
        stcCmdInit.u16CmdType  = SDIOC_CMD_TYPE_NORMAL;
        u32SdMode              = SDIOC_GetMode(SDIOCx);
        if (SDIOC_MODE_SD != u32SdMode)   /* MMC mode */
        {
            stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
            stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1B_R5B;
        }
        else
        {
            stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_ENABLE;
            stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1_R5_R6_R7;
        }
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            if (SDIOC_MODE_SD != u32SdMode)   /* MMC mode */
            {
                enRet = SDMMC_GetCmdResp1Busy(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
            }
            else
            {
                enRet = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
            }
        }
    }

    return enRet;
}

/**
 * @brief  Send the Select Deselect command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32RCA                  Relative Card Address(RCA)
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD7_SelectDeselectCard(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32RCA, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

