RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = u32RCA;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD7_SELECT_DESELECT_CARD;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1B_R5B;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdResp1Busy(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
        }
    }

    return enRet;
}

/**
 * @brief  Send the Interface Condition command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD8_SendInterfaceCond(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;
    uint32_t u32SdMode;

    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Argument: - [31:12]: Reserved (shall be set to '0')
        - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
        - [7:0]: Check Pattern (recommended 0xAA) */
        stcCmdInit.u32Argument = SDMMC_CMD8_CHECK_PATTERN;
        stcCmdInit.u16CmdIndex = SDIOC_CMD8_SEND_IF_COND;
        stcCmdInit.u16CmdType  = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16RespType = SDIOC_RESOPNE_TYPE_R1_R5_R6_R7;
        u32SdMode              = SDIOC_GetMode(SDIOCx);
        if (SDIOC_MODE_SD != u32SdMode)   /* MMC mode */
        {
            stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_ENABLE;
        }
        else
        {
            stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        }
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            if (SDIOC_MODE_SD != u32SdMode)   /* MMC mode */
            {
                enRet = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
            }
            else
            {
                enRet = SDMMC_GetCmdResp7(SDIOCx, pu32ErrSta);
            }
        }
    }

    return enRet;
}

/**
 * @brief  Send the Send CSD command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32RCA                  Relative Card Address(RCA)
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD9_SendCSD(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32RCA, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = u32RCA;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD9_SEND_CSD;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R2;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
         if (Ok == enRet)
         {
             enRet = SDMMC_GetCmdResp2(SDIOCx, pu32ErrSta);
         }
    }

    return enRet;
}

/**
 * @brief  Send the Stop Transfer command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD12_StopTransmission(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = 0UL;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD12_STOP_TRANSMISSION;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1B_R5B;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdResp1Busy(SDIOCx, SDMMC_CMD_TIMEOUT * 1000UL, pu32ErrSta);
        }
    }

    return enRet;
}

/**
 * @brief  Send the Status command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32RCA                  Relative Card Address(RCA)
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD13_SendStatus(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32RCA, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

