RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = u32RCA;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD13_SEND_STATUS;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1_R5_R6_R7;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
        }
    }

    return enRet;
}

/**
 * @brief  Send the Data Block Lenght command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32BlockLen             Block length
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD16_SetBlockLength(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32BlockLen, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = u32BlockLen;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD16_SET_BLOCKLEN;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1_R5_R6_R7;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
        }
    }

    return enRet;
}

/**
 * @brief  Send the Read Single Block command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32ReadAddr             Data address
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD17_ReadSingleBlock(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32ReadAddr, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = u32ReadAddr;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD17_READ_SINGLE_BLOCK;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_ENABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1_R5_R6_R7;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
        }
    }

    return enRet;
}

/**
 * @brief  Send the Read Multi Block command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32ReadAddr             Data address
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD18_ReadMultipleBlock(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32ReadAddr, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = u32ReadAddr;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD18_READ_MULTIPLE_BLOCK;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_ENABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1_R5_R6_R7;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
        }
    }

    return enRet;
}

/**
 * @brief  Send the Write Single Block command and check the response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32WriteAddr            Data address
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorInvalidParameter: SDIOCx == NULL or pu32ErrSta == NULL
 *           - ErrorTimeout: Wait timeout
 */
en_result_t SDMMC_CMD24_WriteSingleBlock(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32WriteAddr, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    stc_sdioc_cmd_init_t stcCmdInit;

