RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (NULL == pu32ErrSta)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcCmdInit.u32Argument   = u32EndAddr;
        stcCmdInit.u16CmdIndex   = SDIOC_CMD36_ERASE_GRP_END;
        stcCmdInit.u16CmdType    = SDIOC_CMD_TYPE_NORMAL;
        stcCmdInit.u16DataLineEn = SDIOC_DATA_LINE_DISABLE;
        stcCmdInit.u16RespType   = SDIOC_RESOPNE_TYPE_R1_R5_R6_R7;
        enRet = SDIOC_SendCommand(SDIOCx, &stcCmdInit);
        /* Check for error conditions */
        if (Ok == enRet)
        {
            enRet = SDMMC_GetCmdResp1(SDIOCx, SDMMC_CMD_TIMEOUT, pu32ErrSta);
        }
    }

    return enRet;
}

/**
 * @brief  Wait for command response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32CheckFlag            Check flags
 *         This parameter can be one or any combination the following values:
 *           @arg SDIOC_NORMAL_INT_FLAG_CC:     Command Complete status
 *           @arg SDIOC_ERROR_INT_FLAG_CIE:     Command Index Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CEBE:    Command End Bit Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CCE:     Command CRC Error status
 *           @arg SDIOC_ERROR_INT_FLAG_CTOE:    Command Timeout Error status
 * @param  [in] u32Timeout              Timeout time(ms) for waiting SDIOC
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: The response is normal received
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t SDMMC_WaitResponse(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32CheckFlag, uint32_t u32Timeout, uint32_t *pu32ErrSta)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;
    uint32_t u32Temp;

    *pu32ErrSta = 0UL;
    /* The u32Timeout is expressed in ms */
    u32Count = u32Timeout * (HCLK_VALUE / 20000UL);
    while (Reset == SDIOC_GetIntStatus(SDIOCx, u32CheckFlag))
    {
        if (0UL == u32Count)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    if (Ok == enRet)
    {
        enRet = Error;
        u32Temp = CLEAR_REG32_BIT(u32CheckFlag, SDIOC_NORMAL_INT_FLAG_CC);
        if (Reset == SDIOC_GetIntStatus(SDIOCx, u32Temp))
        {
            /* No error flag set */
            *pu32ErrSta = SDMMC_ERROR_NONE;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_ERROR_INT_STATIC_FLAGS);
            enRet = Ok;
        }
        else if ((Reset != SDIOC_GetIntStatus(SDIOCx, SDIOC_ERROR_INT_FLAG_CIE)) &&
                 (SDIOC_ERROR_INT_FLAG_CIE == (u32CheckFlag & SDIOC_ERROR_INT_FLAG_CIE)))
        {
            *pu32ErrSta = SDMMC_ERROR_CMD_INDEX;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_ERROR_INT_FLAG_CIE);
        }
        else if ((Reset != SDIOC_GetIntStatus(SDIOCx, SDIOC_ERROR_INT_FLAG_CEBE)) &&
                 (SDIOC_ERROR_INT_FLAG_CEBE == (u32CheckFlag & SDIOC_ERROR_INT_FLAG_CEBE)))
        {
            *pu32ErrSta = SDMMC_ERROR_CMD_STOP_BIT;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_ERROR_INT_FLAG_CEBE);
        }
        else if ((Reset != SDIOC_GetIntStatus(SDIOCx, SDIOC_ERROR_INT_FLAG_CCE)) &&
                 (SDIOC_ERROR_INT_FLAG_CCE == (u32CheckFlag & SDIOC_ERROR_INT_FLAG_CCE)))
        {
            *pu32ErrSta = SDMMC_ERROR_CMD_CRC_FAIL;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_ERROR_INT_FLAG_CCE);
        }
        else
        {
            *pu32ErrSta = SDMMC_ERROR_CMD_TIMEOUT;
            SDIOC_ClearIntStatus(SDIOCx, SDIOC_ERROR_INT_FLAG_CTOE);
        }
    }

    return enRet;
}

/**
 * @brief  Checks for error conditions for no response command.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: Command send completed
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t SDMMC_GetCmdError(M4_SDIOC_TypeDef *SDIOCx)
{
    __IO uint32_t u32Count;
    en_result_t enRet = Ok;

    /* The SDMMC_CMD_TIMEOUT is expressed in ms */
    u32Count = SDMMC_CMD_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (Reset == SDIOC_GetIntStatus(SDIOCx, SDIOC_NORMAL_INT_FLAG_CC))
    {
        if (0UL == u32Count)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    if (Ok == enRet)
    {
        SDIOC_ClearIntStatus(SDIOCx, SDIOC_ERROR_INT_STATIC_FLAGS);
    }

    return enRet;
}

/**
 * @brief  Checks for error conditions for R1 response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32Timeout              Timeout time(ms) for waiting SDIOC
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: The response is normal received
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t SDMMC_GetCmdResp1(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32Timeout, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    uint32_t u32RespVal;

    enRet = SDMMC_WaitResponse(SDIOCx,
                               (SDIOC_NORMAL_INT_FLAG_CC  | SDIOC_ERROR_INT_FLAG_CIE | SDIOC_ERROR_INT_FLAG_CEBE |
                                SDIOC_ERROR_INT_FLAG_CCE  | SDIOC_ERROR_INT_FLAG_CTOE), u32Timeout, pu32ErrSta);

