RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_sdioc.c
    if (Ok == enRet)
    {
        /* Fetch has received a response. */
        (void)SDIOC_GetResponse(SDIOCx, SDIOC_RESPONSE_REG_BIT0_31, &u32RespVal);
        if (0UL != (u32RespVal & SDMMC_CARD_ERROR_BITS_MASK))
        {
            *pu32ErrSta = u32RespVal & SDMMC_CARD_ERROR_BITS_MASK;
            enRet = Error;
        }
    }

    return enRet;
}

/**
 * @brief  Checks for error conditions for R1 response with busy.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [in] u32Timeout              Timeout time(ms) for waiting SDIOC
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: The response is normal received
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t SDMMC_GetCmdResp1Busy(M4_SDIOC_TypeDef *SDIOCx, uint32_t u32Timeout, uint32_t *pu32ErrSta)
{
    __IO uint32_t u32Count;
    en_result_t enRet;
    uint32_t u32RespVal;

    enRet = SDMMC_WaitResponse(SDIOCx,
                               (SDIOC_NORMAL_INT_FLAG_CC  | SDIOC_ERROR_INT_FLAG_CIE | SDIOC_ERROR_INT_FLAG_CEBE |
                                SDIOC_ERROR_INT_FLAG_CCE  | SDIOC_ERROR_INT_FLAG_CTOE), u32Timeout, pu32ErrSta);

    if (Ok == enRet)
    {
        /* Fetch has received a response. */
        (void)SDIOC_GetResponse(SDIOCx, SDIOC_RESPONSE_REG_BIT0_31, &u32RespVal);
        if (0UL != (u32RespVal & SDMMC_CARD_ERROR_BITS_MASK))
        {
            *pu32ErrSta = u32RespVal & SDMMC_CARD_ERROR_BITS_MASK;
            enRet = Error;
        }
        else
        {
            /* Wait for busy status to release */
            u32Count = u32Timeout * (HCLK_VALUE / 20000UL);
            while (Reset == SDIOC_GetHostStatus(SDIOCx, SDIOC_HOST_FLAG_DATL_D0))
            {
                if (0UL == u32Count)
                {
                    enRet = ErrorTimeout;
                    break;
                }
                u32Count--;
            }
        }
    }

    return enRet;
}

/**
 * @brief  Checks for error conditions for R2(CID or CSD) response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: The response is normal received
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t SDMMC_GetCmdResp2(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta)
{
    return SDMMC_WaitResponse(SDIOCx,
                              (SDIOC_NORMAL_INT_FLAG_CC | SDIOC_ERROR_INT_FLAG_CEBE | SDIOC_ERROR_INT_FLAG_CCE |
                               SDIOC_ERROR_INT_FLAG_CTOE), SDMMC_CMD_TIMEOUT, pu32ErrSta);
}

/**
 * @brief  Checks for error conditions for R3(OCR) response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: The response is normal received
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t SDMMC_GetCmdResp3(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta)
{
    return SDMMC_WaitResponse(SDIOCx,
                              (SDIOC_NORMAL_INT_FLAG_CC | SDIOC_ERROR_INT_FLAG_CEBE | SDIOC_ERROR_INT_FLAG_CTOE),
                              SDMMC_CMD_TIMEOUT, pu32ErrSta);
}

/**
 * @brief  Checks for error conditions for R6(RCA) response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu16RCA                Pointer to a value of device RCA
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: The response is normal received
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t SDMMC_GetCmdResp6(M4_SDIOC_TypeDef *SDIOCx, uint16_t *pu16RCA, uint32_t *pu32ErrSta)
{
    en_result_t enRet;
    uint32_t u32RespVal;

    enRet = SDMMC_WaitResponse(SDIOCx,
                               (SDIOC_NORMAL_INT_FLAG_CC  | SDIOC_ERROR_INT_FLAG_CIE | SDIOC_ERROR_INT_FLAG_CEBE |
                                SDIOC_ERROR_INT_FLAG_CCE  | SDIOC_ERROR_INT_FLAG_CTOE), SDMMC_CMD_TIMEOUT, pu32ErrSta);

    if (Ok == enRet)
    {
        enRet = Error;
        /* Fetch has received a response. */
        (void)SDIOC_GetResponse(SDIOCx, SDIOC_RESPONSE_REG_BIT0_31, &u32RespVal);
        if (0UL == (u32RespVal & (SDMMC_R6_GENERAL_UNKNOWN_ERROR | SDMMC_R6_ILLEGAL_CMD | SDMMC_R6_COM_CRC_FAILED)))
        {
            enRet = Ok;
            *pu16RCA = (uint16_t)((u32RespVal >> 16U) & 0xFFFFUL);
        }
        else if (SDMMC_R6_GENERAL_UNKNOWN_ERROR == (u32RespVal & SDMMC_R6_GENERAL_UNKNOWN_ERROR))
        {
            *pu32ErrSta = SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
        }
        else if (SDMMC_R6_ILLEGAL_CMD == (u32RespVal & SDMMC_R6_ILLEGAL_CMD))
        {
            *pu32ErrSta = SDMMC_ERROR_ILLEGAL_CMD;
        }
        else
        {
            *pu32ErrSta = SDMMC_ERROR_COM_CRC_FAILED;
        }
    }

    return enRet;
}

/**
 * @brief  Checks for error conditions for R7 response.
 * @param  [in] SDIOCx                  Pointer to SDIOC instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_SDIOC1:            SDIOC unit 1 instance register base
 *           @arg M4_SDIOC2:            SDIOC unit 2 instance register base
 * @param  [out] pu32ErrSta             Pointer to the error state value
 * @retval An en_result_t enumeration value:
 *           - Ok: The response is normal received
 *           - Error: Refer to pu32ErrSta for the reason of error
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t SDMMC_GetCmdResp7(M4_SDIOC_TypeDef *SDIOCx, uint32_t *pu32ErrSta)
{
    return SDMMC_WaitResponse(SDIOCx,
                              (SDIOC_NORMAL_INT_FLAG_CC  | SDIOC_ERROR_INT_FLAG_CIE | SDIOC_ERROR_INT_FLAG_CEBE |
                               SDIOC_ERROR_INT_FLAG_CCE  | SDIOC_ERROR_INT_FLAG_CTOE), SDMMC_CMD_TIMEOUT, pu32ErrSta);
}

/**
 * @}
 */

#endif /* DDL_SDIOC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
